{"config": [{"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 6418, 4], "activity_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "name": "conv1d_1", "kernel_constraint": null, "dilation_rate": [1], "kernel_regularizer": null, "filters": 100, "dtype": "float32", "activation": "relu", "strides": [1], "bias_constraint": null, "kernel_size": [4], "trainable": true, "padding": "valid", "bias_regularizer": null}, "class_name": "Conv1D"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "strides": [1], "name": "conv1d_2", "kernel_constraint": null, "activity_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "dilation_rate": [1], "kernel_regularizer": null, "filters": 200, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [4], "padding": "valid", "trainable": true}, "class_name": "Conv1D"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activation": "relu", "strides": [1], "name": "conv1d_3", "kernel_constraint": null, "activity_regularizer": {"config": {"l2": 0.009999999776482582, "l1": 0.0}, "class_name": "L1L2"}, "dilation_rate": [1], "kernel_regularizer": null, "filters": 300, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [4], "padding": "valid", "trainable": true}, "class_name": "Conv1D"}, {"config": {"pool_size": [20], "strides": [20], "name": "max_pooling1d_1", "padding": "valid", "trainable": true}, "class_name": "MaxPooling1D"}, {"config": {"center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "momentum": 0.99, "name": "batch_normalization_1", "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"rate": 0.5, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 400, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "activation": "softmax", "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "trainable": true}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.0.4", "class_name": "Sequential"}