{"class_name": "Sequential", "config": [{"class_name": "Conv1D", "config": {"padding": "valid", "batch_input_shape": [null, 6418, 4], "bias_constraint": null, "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv1d_1", "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "strides": [1], "kernel_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "activation": "relu", "kernel_size": [4], "kernel_constraint": null, "filters": 100}}, {"class_name": "Conv1D", "config": {"padding": "valid", "name": "conv1d_2", "bias_constraint": null, "trainable": true, "filters": 200, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": {"class_name": "L1L2", "config": {"l2": 0.009999999776482582, "l1": 0.0}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "strides": [1], "kernel_regularizer": null, "dilation_rate": [1], "bias_regularizer": null, "activation": "relu", "kernel_size": [4], "kernel_constraint": null}}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [30], "pool_size": [30], "trainable": true, "name": "max_pooling1d_1"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_constraint": null, "trainable": true, "units": 400, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "softmax", "kernel_constraint": null}}], "backend": "tensorflow", "keras_version": "2.0.4"}
